zephyrproject-rtos/hal_gigadevice/include/dt-bindings/pinctrl/gd32f407i(e-g-k)xx-pinctrl.h
/* TIMER4_CH2 */
#define TIMER4_CH2_PA2 \
	GD32_PINMUX_AF('A', 2, AF2)
#define TIMER4_CH2_PH12 \
	GD32_PINMUX_AF('H', 12, AF2)

/* TIMER4_CH3 */
#define TIMER4_CH3_PA3 \
	GD32_PINMUX_AF('A', 3, AF2)
#define TIMER4_CH3_PI0 \
	GD32_PINMUX_AF('I', 0, AF2)

/* TIMER7_BRKIN */
#define TIMER7_BRKIN_PA6 \
	GD32_PINMUX_AF('A', 6, AF3)
#define TIMER7_BRKIN_PI4 \
	GD32_PINMUX_AF('I', 4, AF3)

/* TIMER7_CH0 */
#define TIMER7_CH0_PC6 \
	GD32_PINMUX_AF('C', 6, AF3)
#define TIMER7_CH0_PI5 \
	GD32_PINMUX_AF('I', 5, AF3)

/* TIMER7_CH0_ON */
#define TIMER7_CH0_ON_PA5 \
	GD32_PINMUX_AF('A', 5, AF3)
#define TIMER7_CH0_ON_PA7 \
	GD32_PINMUX_AF('A', 7, AF3)
#define TIMER7_CH0_ON_PH13 \
	GD32_PINMUX_AF('H', 13, AF3)

/* TIMER7_CH1 */
#define TIMER7_CH1_PC7 \
	GD32_PINMUX_AF('C', 7, AF3)
#define TIMER7_CH1_PI6 \
	GD32_PINMUX_AF('I', 6, AF3)

/* TIMER7_CH1_ON */
#define TIMER7_CH1_ON_PB0 \
	GD32_PINMUX_AF('B', 0, AF3)
#define TIMER7_CH1_ON_PB14 \
	GD32_PINMUX_AF('B', 14, AF3)
#define TIMER7_CH1_ON_PH14 \
	GD32_PINMUX_AF('H', 14, AF3)

/* TIMER7_CH2 */
#define TIMER7_CH2_PC8 \
	GD32_PINMUX_AF('C', 8, AF3)
#define TIMER7_CH2_PI7 \
	GD32_PINMUX_AF('I', 7, AF3)

/* TIMER7_CH2_ON */
#define TIMER7_CH2_ON_PB1 \
	GD32_PINMUX_AF('B', 1, AF3)
#define TIMER7_CH2_ON_PB15 \
	GD32_PINMUX_AF('B', 15, AF3)
#define TIMER7_CH2_ON_PH15 \
	GD32_PINMUX_AF('H', 15, AF3)

/* TIMER7_CH3 */
#define TIMER7_CH3_PC9 \
	GD32_PINMUX_AF('C', 9, AF3)
#define TIMER7_CH3_PI2 \
	GD32_PINMUX_AF('I', 2, AF3)

/* TIMER7_ETI */
#define TIMER7_ETI_PA0 \
	GD32_PINMUX_AF('A', 0, AF3)
#define TIMER7_ETI_PI3 \
	GD32_PINMUX_AF('I', 3, AF3)

/* TIMER8_CH0 */
#define TIMER8_CH0_PA2 \
	GD32_PINMUX_AF('A', 2, AF3)
#define TIMER8_CH0_PE5 \
	GD32_PINMUX_AF('E', 5, AF3)

/* TIMER8_CH1 */
#define TIMER8_CH1_PA3 \
	GD32_PINMUX_AF('A', 3, AF3)
#define TIMER8_CH1_PE6 \
	GD32_PINMUX_AF('E', 6, AF3)

/* TIMER9_CH0 */
#define TIMER9_CH0_PB8 \
	GD32_PINMUX_AF('B', 8, AF3)
#define TIMER9_CH0_PF6 \
	GD32_PINMUX_AF('F', 6, AF3)

/* TRACECK */
#define TRACECK_PE2 \
	GD32_PINMUX_AF('E', 2, AF0)

/* TRACED0 */
#define TRACED0_PC8 \
	GD32_PINMUX_AF('C', 8, AF0)
#define TRACED0_PE3 \
	GD32_PINMUX_AF('E', 3, AF0)

/* TRACED1 */
#define TRACED1_PD3 \
	GD32_PINMUX_AF('D', 3, AF0)
#define TRACED1_PE4 \
	GD32_PINMUX_AF('E', 4, AF0)

/* TRACED2 */
#define TRACED2_PE5 \
	GD32_PINMUX_AF('E', 5, AF0)
#define TRACED2_PG13 \
	GD32_PINMUX_AF('G', 13, AF0)

/* TRACED3 */
#define TRACED3_PE6 \
	GD32_PINMUX_AF('E', 6, AF0)
#define TRACED3_PG14 \
	GD32_PINMUX_AF('G', 14, AF0)

/* TRACESWO */
#define TRACESWO_PB3 \
	GD32_PINMUX_AF('B', 3, AF0)

/* UART3_RX */
#define UART3_RX_PA1 \
	GD32_PINMUX_AF('A', 1, AF8)
#define UART3_RX_PC11 \
	GD32_PINMUX_AF('C', 11, AF8)

/* UART3_TX */
#define UART3_TX_PA0 \
	GD32_PINMUX_AF('A', 0, AF8)
#define UART3_TX_PC10 \
	GD32_PINMUX_AF('C', 10, AF8)

/* UART4_RX */
#define UART4_RX_PD2 \
	GD32_PINMUX_AF('D', 2, AF8)

/* UART4_TX */
#define UART4_TX_PC12 \
	GD32_PINMUX_AF('C', 12, AF8)

/* USART0_CK */
#define USART0_CK_PA8 \
	GD32_PINMUX_AF('A', 8, AF7)

/* USART0_CTS */
#define USART0_CTS_PA11 \
	GD32_PINMUX_AF('A', 11, AF7)

/* USART0_RTS */
#define USART0_RTS_PA12 \
	GD32_PINMUX_AF('A', 12, AF7)

/* USART0_RX */
#define USART0_RX_PA10 \
	GD32_PINMUX_AF('A', 10, AF7)
#define USART0_RX_PB3 \
	GD32_PINMUX_AF('B', 3, AF7)
#define USART0_RX_PB7 \
	GD32_PINMUX_AF('B', 7, AF7)

/* USART0_TX */
#define USART0_TX_PA9 \
	GD32_PINMUX_AF('A', 9, AF7)
#define USART0_TX_PA15 \
	GD32_PINMUX_AF('A', 15, AF7)
#define USART0_TX_PB6 \
	GD32_PINMUX_AF('B', 6, AF7)

/* USART1_CK */
#define USART1_CK_PA4 \
	GD32_PINMUX_AF('A', 4, AF7)
#define USART1_CK_PD7 \
	GD32_PINMUX_AF('D', 7, AF7)

/* USART1_CTS */
#define USART1_CTS_PA0 \
	GD32_PINMUX_AF('A', 0, AF7)
#define USART1_CTS_PD3 \
	GD32_PINMUX_AF('D', 3, AF7)

/* USART1_RTS */
#define USART1_RTS_PA1 \
	GD32_PINMUX_AF('A', 1, AF7)
#define USART1_RTS_PD4 \
	GD32_PINMUX_AF('D', 4, AF7)

/* USART1_RX */
#define USART1_RX_PA3 \
	GD32_PINMUX_AF('A', 3, AF7)
#define USART1_RX_PD6 \
	GD32_PINMUX_AF('D', 6, AF7)

/* USART1_TX */
#define USART1_TX_PA2 \
	GD32_PINMUX_AF('A', 2, AF7)
#define USART1_TX_PD5 \
	GD32_PINMUX_AF('D', 5, AF7)

/* USART2_CK */
#define USART2_CK_PB12 \
	GD32_PINMUX_AF('B', 12, AF7)
#define USART2_CK_PC12 \
	GD32_PINMUX_AF('C', 12, AF7)
#define USART2_CK_PD10 \
	GD32_PINMUX_AF('D', 10, AF7)

/* USART2_CTS */
#define USART2_CTS_PB13 \
	GD32_PINMUX_AF('B', 13, AF7)
#define USART2_CTS_PD11 \
	GD32_PINMUX_AF('D', 11, AF7)

/* USART2_RTS */
#define USART2_RTS_PB14 \
	GD32_PINMUX_AF('B', 14, AF7)
#define USART2_RTS_PD12 \
	GD32_PINMUX_AF('D', 12, AF7)

/* USART2_RX */
#define USART2_RX_PB11 \
	GD32_PINMUX_AF('B', 11, AF7)
#define USART2_RX_PC5 \
	GD32_PINMUX_AF('C', 5, AF7)
#define USART2_RX_PC11 \
	GD32_PINMUX_AF('C', 11, AF7)
#define USART2_RX_PD9 \
	GD32_PINMUX_AF('D', 9, AF7)

/* USART2_TX */
#define USART2_TX_PB10 \
	GD32_PINMUX_AF('B', 10, AF7)
#define USART2_TX_PC10 \
	GD32_PINMUX_AF('C', 10, AF7)
#define USART2_TX_PD8 \
	GD32_PINMUX_AF('D', 8, AF7)

/* USART5_CK */
#define USART5_CK_PC8 \
	GD32_PINMUX_AF('C', 8, AF8)
#define USART5_CK_PG7 \
	GD32_PINMUX_AF('G', 7, AF8)

/* USART5_CTS */
#define USART5_CTS_PG13 \
	GD32_PINMUX_AF('G', 13, AF8)
#define USART5_CTS_PG15 \
	GD32_PINMUX_AF('G', 15, AF8)

/* USART5_RTS */
#define USART5_RTS_PG8 \
	GD32_PINMUX_AF('G', 8, AF8)
#define USART5_RTS_PG12 \
	GD32_PINMUX_AF('G', 12, AF8)

/* USART5_RX */
#define USART5_RX_PA12 \
	GD32_PINMUX_AF('A', 12, AF8)
#define USART5_RX_PC7 \
	GD32_PINMUX_AF('C', 7, AF8)
#define USART5_RX_PG9 \
	GD32_PINMUX_AF('G', 9, AF8)

/* USART5_TX */
#define USART5_TX_PA11 \
	GD32_PINMUX_AF('A', 11, AF8)
#define USART5_TX_PC6 \
	GD32_PINMUX_AF('C', 6, AF8)
#define USART5_TX_PG14 \
	GD32_PINMUX_AF('G', 14, AF8)

/* USBFS_DM */
#define USBFS_DM_PA11 \
	GD32_PINMUX_AF('A', 11, AF10)

/* USBFS_DP */
#define USBFS_DP_PA12 \
	GD32_PINMUX_AF('A', 12, AF10)

/* USBFS_ID */
#define USBFS_ID_PA10 \
	GD32_PINMUX_AF('A', 10, AF10)

/* USBFS_SOF */
#define USBFS_SOF_PA8 \
	GD32_PINMUX_AF('A', 8, AF10)

/* USBHS_DM */
#define USBHS_DM_PB14 \
	GD32_PINMUX_AF('B', 14, AF12)

/* USBHS_DP */
#define USBHS_DP_PB15 \
	GD32_PINMUX_AF('B', 15, AF12)

/* USBHS_ID */
#define USBHS_ID_PB12 \
	GD32_PINMUX_AF('B', 12, AF12)

/* USBHS_SOF */
#define USBHS_SOF_PA4 \
	GD32_PINMUX_AF('A', 4, AF12)

/* USBHS_ULPI_CK */
#define USBHS_ULPI_CK_PA5 \
	GD32_PINMUX_AF('A', 5, AF10)

/* USBHS_ULPI_D0 */
#define USBHS_ULPI_D0_PA3 \
	GD32_PINMUX_AF('A', 3, AF10)

/* USBHS_ULPI_D1 */
#define USBHS_ULPI_D1_PB0 \
	GD32_PINMUX_AF('B', 0, AF10)

/* USBHS_ULPI_D2 */
#define USBHS_ULPI_D2_PB1 \
	GD32_PINMUX_AF('B', 1, AF10)

/* USBHS_ULPI_D3 */
#define USBHS_ULPI_D3_PB10 \
	GD32_PINMUX_AF('B', 10, AF10)

/* USBHS_ULPI_D4 */
#define USBHS_ULPI_D4_PB2 \
	GD32_PINMUX_AF('B', 2, AF10)
#define USBHS_ULPI_D4_PB11 \
	GD32_PINMUX_AF('B', 11, AF10)

/* USBHS_ULPI_D5 */
#define USBHS_ULPI_D5_PB12 \
	GD32_PINMUX_AF('B', 12, AF10)

/* USBHS_ULPI_D6 */
#define USBHS_ULPI_D6_PB13 \
	GD32_PINMUX_AF('B', 13, AF10)

/* USBHS_ULPI_D7 */
#define USBHS_ULPI_D7_PB5 \
	GD32_PINMUX_AF('B', 5, AF10)

/* USBHS_ULPI_DIR */
#define USBHS_ULPI_DIR_PC2 \
	GD32_PINMUX_AF('C', 2, AF10)
#define USBHS_ULPI_DIR_PI11 \
	GD32_PINMUX_AF('I', 11, AF10)

/* USBHS_ULPI_NXT */
#define USBHS_ULPI_NXT_PC3 \
	GD32_PINMUX_AF('C', 3, AF10)
#define USBHS_ULPI_NXT_PH4 \
	GD32_PINMUX_AF('H', 4, AF10)

/* USBHS_ULPI_STP */
#define USBHS_ULPI_STP_PC0 \
	GD32_PINMUX_AF('C', 0, AF10)
